# 행 선택
- loc
    - 인덱스 이름을 사용

- iloc
    - 정수형 위치 인덱스를 사용

In [1]:
import pandas as pd

In [4]:
# ord() : 문자를 전달하면 해당 문자의 유니코드 값은 반환
# chr() : 특정 문자의 유니코드 값은 전달하면 해당 문자를 변환

ord("a"), ord("z")

(97, 122)

In [6]:
for i in range(97, 123):
    print(chr(i), end = " ")

a b c d e f g h i j k l m n o p q r s t u v w x y z

In [7]:
df_index = pd.DataFrame({"value" : [i for i in range(26)]},
                        index = [chr(i) for i in range(97, 123)])

In [8]:
df_index

   value
a      0
b      1
c      2
d      3
e      4
f      5
g      6
h      7
i      8
j      9
k     10
l     11
m     12
n     13
o     14
p     15
q     16
r     17
s     18
t     19
u     20
v     21
w     22
x     23
y     24
z     25

In [10]:
df_index.loc["a"]

value    0
Name: a, dtype: int64

In [11]:
df_index.loc["z"]

value    25
Name: z, dtype: int64

In [12]:
df_index.iloc[0]

value    0
Name: a, dtype: int64

In [13]:
df_index.iloc[-1]

value    25
Name: z, dtype: int64

In [16]:
 # 하나의 행을 데이터프레임으로 추출
df_index.loc[["a"]]

   value
a      0

In [17]:
df_index.iloc[[0]]

   value
a      0

In [18]:
# 여러 행 선택
df_index.loc[["a", "c"]]

   value
a      0
c      2

In [19]:
df_index.iloc[[0, 2]]

   value
a      0
c      2

In [20]:
# 행 인덱스의 범위를 지정하여 행 선택
df_index.loc["a" : "c"]

   value
a      0
b      1
c      2

In [21]:
df_index.iloc[0 : 2]

   value
a      0
b      1

# 열 선택
- 열 데이터를 1개만 선택하는 경우
    - 대괄호 안에 열 이름을 따옴표와 함께 입력
    - 도트(.) 다음에 열 이름 입력
        - 열 이름이 문자열일 경우에만 가능
       
- 여러 열을 선택하는 경우
    - 대괄호 안에 열 이름 리스트 입력
    - 리스트의 원소로 열 이름이 하나만 있는 경우에는 시리즈가 아니라 데이터프레임이 됨

In [23]:
raw_data = {"이름" : ["이상해씨", "파이리", "꼬부기", "캐터피"],
            "타입" : ["풀", "불", "물", "벌레"],
            "체력" : [45, 39, 44, 45],
            "도감등록" : ["yes", "no", "yes", "no"],
            "서식지" : ["공원", "도로", "호수", "숲"]}
            
df = pd.DataFrame(raw_data)

In [24]:
df

     이름  타입  체력 도감등록 서식지
0  이상해씨   풀  45  yes  공원
1   파이리   불  39   no  도로
2   꼬부기   물  44  yes  호수
3   캐터피  벌레  45   no   숲

In [27]:
# 하나의 열 선택
column1 = df["타입"]

In [28]:
column1

0     풀
1     불
2     물
3    벌레
Name: 타입, dtype: object

In [29]:
type(column1)

pandas.core.series.Series

In [30]:
column2 = df.체력

In [32]:
column2

0    45
1    39
2    44
3    45
Name: 체력, dtype: int64

In [35]:
# 여러 열 선택
df[["이름", "타입"]]

     이름  타입
0  이상해씨   풀
1   파이리   불
2   꼬부기   물
3   캐터피  벌레

In [36]:
# 하나의 열을 데이터프레임으로 추출
col_hp = df[["체력"]]

In [37]:
col_hp

   체력
0  45
1  39
2  44
3  45

In [38]:
type(col_hp)

pandas.core.frame.DataFrame